In [8]:
import pandas as pd

In [9]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[10,11,124,5]})

In [10]:
var2 = pd.DataFrame({"A":[1,2,3,4],"C":[21,22,23,24]})

In [11]:
# now we will call merge

In [12]:
pd.merge(var1,var2,on="A")  # on signifies the common part that we want to keep

   A    B   C
0  1   10  21
1  2   11  22
2  3  124  23
3  4    5  24

In [16]:
# we can pass thee paramters left right or outer
pd.merge(var1,var2,how="right")

   A    B   C
0  1   10  21
1  2   11  22
2  3  124  23
3  4    5  24

In [17]:
# to check which data is present or absent

In [18]:
pd.merge(var1,var2,how="left",indicator=True)

   A    B   C _merge
0  1   10  21   both
1  2   11  22   both
2  3  124  23   both
3  4    5  24   both

In [19]:
# concat parameter which is used to join series

In [21]:
s1 = pd.Series([1,2,3,4])
s2 = pd.Series([10,11,12,14])

In [22]:
pd.concat([s1,s2])

0     1
1     2
2     3
3     4
0    10
1    11
2    12
3    14
dtype: int64

In [23]:

# the data is concated

In [25]:
pd.concat([var1,var2])

   A      B     C
0  1   10.0   NaN
1  2   11.0   NaN
2  3  124.0   NaN
3  4    5.0   NaN
0  1    NaN  21.0
1  2    NaN  22.0
2  3    NaN  23.0
3  4    NaN  24.0

In [26]:
# if we want to concat along the coloumn set axis =1

In [28]:
pd.concat([var1,var2],axis=1)

   A    B  A   C
0  1   10  1  21
1  2   11  2  22
2  3  124  3  23
3  4    5  4  24

In [29]:
# now we will use the join parameter

In [30]:
# join has the paramteres which are intersect,inner,outer,unio

In [31]:
pd.concat([var1,var2],axis=1,join="outer")

   A    B  A   C
0  1   10  1  21
1  2   11  2  22
2  3  124  3  23
3  4    5  4  24

In [33]:
pd.concat([var1,var2],axis=1,join="intersect")

ValueError: Only can inner (intersect) or outer (union) join the other axis

In [35]:

pd.concat([var1,var2],join='inner')  # only the common is joined

   A
0  1
1  2
2  3
3  4
0  1
1  2
2  3
3  4

In [36]:

# keys paramters which is used to join according to a particular partamter

In [39]:
pd.concat([var1,var2],axis=1,keys=["var1","var2"])  # meging according to particular paramter

  var1      var2
     A    B    A   C
0    1   10    1  21
1    2   11    2  22
2    3  124    3  23
3    4    5    4  24